[
{"title": "The first-ever edition of ISPL, a T10 tennis-ball cricket tournament, launched in Mumbai", "url": "/cricket/the-first-ever-edition-of-ispl-a-t10-tennis-ball-cricket-tournament-launched-in-mumbai-101701086283641.html", "content": "Mumbai (Maharashtra) [India], November 27 (ANI): In a pioneering move to bring the thrill of cricket from the streets to the stadium, the first-ever edition of the Indian Street Premier League (ISPL) will be held in March next year. All the matches will be held in a stadium from March 2 to March 9 next year in T10 format. This unique initiative, which will feature 19 high-octane matches in Mumbai, is set to captivate fans and provide aspiring cricket talent with an unprecedented opportunity to showcase their talents on the grand stage.The Indian Street Premier League will feature six teams, each owned by franchises representing Mumbai (Maharashtra), Hyderabad (Andhra Pradesh and Telangana), Bengaluru (Karnataka), Chennai (Tamil Nadu), Kolkata (West Bengal), and Srinagar (Jammu and Kashmir). These matches will be conducted within full-fledged stadiums, adding to the flair and grandeur for players and fans.At the heart of ISPL lies the vision to empower the vast community of players who dream of playing cricket in top-tier stadiums like their idols. Recognising the constraints and economic challenges faced by many such talented players, ISPL aims to bridge the gap between the streets and the stadium. This tournament serves as a platform for these players to hone their skills, showcasing their potential on a national stage.Board of Control for Cricket in India (BCCI) Treasurer Ashish Shelar, Core Committee Member of the Indian Street Premier League said, \"ISPL is not just a tournament; it is a transformative journey for aspiring players. Participants will not only compete in a dynamic T10 format but will also receive invaluable coaching tips and advice from seasoned Ranji Trophy players. This mentorship opportunity aims to elevate the skills and understanding of the game among the players, creating a pathway for their future success in the world of cricket.\"Mumbai Cricket Association (MCA) President Amol Kale, Core Committee Member of Indian Street Premier League, \"The ISPL not only brings a dynamic and entertaining cricket format to the forefront but more importantly, it opens the gates for extraordinary talent that often goes unnoticed. It provides a vital platform for those players who dream of playing inside the stadiums, allowing them to showcase their exceptional skills to a wider audience.\"Ravi Shastri, Chief Mentor, of Indian Street Premier League said, \"The ISPL will offer the cricketing dreams of many a chance to flourish on a big stage. I commend the organizers for their vision and commitment to nurturing grassroots talent, and I look forward to witnessing the success stories that will undoubtedly emerge from this exciting venture.\"The Indian Street Premier League promises to be a cricketing carnival, merging the spirit of the streets with the grandeur of stadium cricket. Fans, players, and cricket enthusiasts alike are invited to witness the birth of a new era in Indian cricket.Players are invited to register for the tournament here before December 20th this year. (ANI)"},
{"title": "Gujarat Titans director on Hardik's decision to return to MI ahead of IPL 2024", "url": "/cricket/gujarat-titans-director-opens-up-on-hardik-pandya-decision-to-return-to-mumbai-indians-ahead-of-ipl-2024-101701080416286.html", "content": "The speculations, rumours and reports all turned true on Sunday after , hours after it was officially announced that Gujarat Titans had retained their captain for the 2024 season of the Indian Premier League (IPL). While the owners of Mumbai Indians welcomed back the star all-rounder with open arms, Gujarat, in their first reaction since the big IPL trade announcement, revealed that it was Hardik's desire to return to his former franchise.Hardik had led Gujarat to a stunning IPL title win in their maiden appearance in the league in 2022 and was the Player of the Match in the final as well for his all-round show. In the following season, they reached the final yet again, but lost to MS Dhoni-led Chennai Super Kings. In his two seasons with the Titans, where the franchise finished top of the table both the times, Hardik's leadership qualities came to fore and eventually was given the role for the Indian white-ball matches as well each time regular skipper Rohit Sharma opted for a rest.Gujarat Titans Director of Cricket Vikram Solanki, in a statement on Monday, revealed that it was Hardik's decision to return to Mumbai Indians and he wished him all the luck.\"As the first captain of Gujarat Titans, Hardik Pandya has helped the franchise deliver two fantastic seasons that resulted in winning one TATA IPL championship and one appearance in the final. He has now expressed a desire to return to his original team Mumbai Indians. We respect his decision and wish him all the very best in his future endeavours,\" Solanki said.Despite his achievements with Titans, Hardik had risen to fame during his years at Mumbai Indians, who had roped him in for just INR 10 lakhs back in 2015 when he was an uncapped player. He later became a core member of the franchise and was part of their title-winning runs in 2015, 2017, 2019 and 2020. Hardik was however shockingly released by Mumbai ahead of the 2022 mega auction, before Gujarat had roped him in as their captain.\"We are thrilled to welcome Hardik back home! It's a heartwarming reunion with our Mumbai Indians family,\" Nita M Ambani, owner of Mumbai Indians, said. \"From being a young scouted talent of Mumbai Indians to now being a team India star, Hardik has come a long way and we're excited for what the future holds for him and Mumbai Indians!\"Akash Ambani, owner of Mumbai Indians, said: \"Seeing Hardik back at Mumbai Indians makes me very happy. It is a happy homecoming. He provides great balance to any team he plays. Hardik's first stint with the MI family was hugely successful, and we hope he achieves even more success in his second stint.\""},
{"title": "'Serious challenger for T20 World Cup': Shastri makes huge prediction", "url": "/cricket/serious-challenger-for-t20-world-cup-shastri-makes-huge-prediction-says-even-the-great-man-sachin-had-to-wait-101701085881079.html", "content": "India's 2023 ODI World Cup campaign had all elements necessary for a blockbuster Bollywood script. The hosts were unbeaten throughout the tournament and showcased dominating cricket, but it was in the final that they received a brutal reality check against Australia, losing by six wickets in Ahmedabad.Chasing 241 runs, Pat Cummins and Co. reached to 241/4 in 43 overs, courtesy of a ton from Travis Head (137) and an unbeaten half-century from Marnus Labuschagne (58*). In what turned out to be a disappointing day for Indian bowlers, Jasprit Bumrah took two wickets, Mohammed Siraj and Mohammed Shami bagged a dismissal each.But the Indian bowlers were put in such a situation by the dismal performance of India's batting order. KL Rahul was India's top-scorer with a knock of 66 off 107 balls and Virat Kohli (54) got a half-century as India reached 240 in 50 overs. The Aussie pacers were in fiery form and destroyed the Indian top and middle order. Mitchell Starc took three wickets, Cummins and Josh Hazlewood bagged two-wicket hauls.Speaking to PTI, former India head coach Ravi Shastri pointed out that although it was a heartbreaking defeat, the team has built a strong nucleus to challenge for the T20 World Cup title next year. \"It was heartbreaking but a lot of our guys will learn, the game moves on, and I see India winning a World Cup very soon,\" he said.\"It might not be a 50-overs (one) that easily because you have to rebuild the side but 20-overs cricket, the very next one India will be very serious challenger because you have got the nucleus. This is a shorter format of the game. Your focus should be on that.\"Shastri also pointed out that players need to be patient as even the legendary Sachin Tendulkar had to wait for six World Cups. \"To be honest, it still hurts from the outside, that we could not win the cup because we were the strongest team. Nothing comes easy -- even the great man Sachin Tendulkar had to wait (for) six World Cups to win one. You don't win (a) World Cup (easily), to win a World Cup you have got to be damn good on that big day,\" Shastri said during the registration launch of the Indian Street Premier League here,\" he said.\"What you do earlier does not count, on that big day, that is when you rise to the occasion. Even before the start of the tournament you knew that, what happens (in terms of the format). Early doors (are there), (and) once top four teams are there, in the semifinal and final, those two days if you perform, you win. And those were the two days when Australia performed when they came from nowhere.\"They lost the first two, but on the D-day, the two days, they did. The way the bowling stood up towards the mid stage of the tournament you thought they had a great, great chance,\" he further added.India have begun their post-World Cup campaign on a strong note, and are currently leading 2-0 against Australia in a five-match T20I series. Senior players like Rohit Sharma and Kohli have been rested, with Suryakumar Yadav captaining the side."},
{"title": "\"It's an opportunity for youngsters\": Bangladesh head coach Hathurusingha ahead of NZ Test", "url": "/cricket/its-an-opportunity-for-youngsters-bangladesh-head-coach-hathurusingha-ahead-of-nz-test-101701091423069.html", "content": "Dhaka [Bangladesh], November 27 (ANI): Ahead of the first Test against New Zealand, Bangladesh head coach Chandika Hathurusingha believes this series will be an exciting opportunity for youngsters.Following a lacklustre ICC World Cup campaign, Bangladesh will play a two-Test series at home against New Zealand in a different format.The team will have a new look because several of its veteran players will be missing the series for different reasons. Star all-rounder Shakib Al Hasan will miss the series due to a finger injury, Litton Das has been granted paternity leave, and Taskin Ahmed has a shoulder niggle to manage.Apart from them, senior opener Tamim Iqbal also remains out of contention.Speaking to the reporters ahead of the game, Hathurusingha stated that losing this amount of experience was a significant setback for Bangladesh. \"It's challenging to lose that much of experience from any team, especially for Bangladesh. Those guys have been part of the Bangladesh team in every format for more than 15 years. Some of them for ten years,\" Hathurusingha was quoted as saying by ICC. He clarified that this just meant that Bangladesh's young cricket players now had more possibilities.\"It is however something to look forward to, to see what the youngsters can do. I think it's a time that we need to move on from some of the players that have played for a long time. They are not going to be there forever,\" Hathurusingha added. \"But this is happening because of many reasons. I think it's exciting and it's an opportunity for some of the youngsters to make their name and then have a long career,\" Hathurusingha said. Hasan Murad, Hasan Mahmud, and Shahadat Hossain Dipu are the three players in Bangladesh's team who do not have Test caps.Hathurusingha was also fully aware of the difficulty posed by his lack of red-ball cricket experience before the series. However, after returning from the World Cup, a few Bangladeshi players were able to play in their first-class National Cricket League's final round.\"The challenge is these guys haven't played enough cricket leading up to. So our planning has to be a little bit better than this going forward and making a bigger pool of players available for every position in bowling and batting.\"We used the NCL matches for the guys who played the World Cup as preparation. Most of the batters made use of that opportunity. Most of the other players have been playing NCL. This is almost like a new-look Bangladesh team for various reasons. Not by design. I think we are ready as we can be and I'm looking forward to this Test series,\" he added. The coach banked on his spin attack to deliver for the Tigers in the series.\"There is experience in Taijul [Islam] and [Mehidy Hasan] Miraz. Taijul has 177 Test wickets. Definitely, he'll be a leader of the attack and Miraz is playing since 2016 if I remember correctly,\" Hathurusingha added. \"Then there's young Murad and Naeem Hassan. I think playing on this condition and this heat, those guys, spinners mainly, will play a big role.\"The first Test commences on Tuesday in Sylhet.Bangladesh Test squad: Najmul Hossain Shanto (c), Shadman Islam, Mehidy Hasan Miraz, Mominul Haque, Shahadat Hossain Dipu, Mushfiqur Rahim, Nurul Hasan, Mahmudul Hasan, Taijul Islam, Naeem Hasan, Khaled Ahmed, Shoriful Islam, Hasan Mahmud, Hasan Murad, Zakir Hasan. (ANI)"},
{"title": "'One of the biggest leagues': Pakistan star expresses desire to play in IPL", "url": "/cricket/it-is-one-of-the-biggest-leagues-pakistan-star-expresses-desire-to-play-in-ipl-if-there-is-an-opportunity-in-future-101701080330240.html", "content": "There was a teaser of the drama that comes with the Indian Premier League (IPL) during the deadline day for teams to announce their released and retained players. The biggest move came just after the day with Hardik Pandya leaving the Gujarat Titans, whom he had led to the title in their first year and to second place in their second year, and returning to the Mumbai Indians.Pakistan players like Shahid Afridi, Shoaib Akhtar and Misbah-ul-Haq played in the inaugural edition of the IPL but were later shunned by teams in the aftermath of the November 26, 2008 terror attack in Mumbai. Players from the country have never played in the league since but a number of them have expressed their desire to play in the IPL over the years. The most recent of them is fast bowler Hasan Ali.“Every player wants to play IPL & it is my wish to play there. It is one of the biggest leagues in the world and I will definitely play there if there is an opportunity in the future,” said Hasan on Samaa Lounge. Earlier this year former Sunrisers Hyderabad coach Tom Moody had said that the likes of Babar Azam, Mohammad Rizwan, Shadab Khan and Shaheen Afridi would be \"box office\" if they play in the IPL. “Shaheen Afridi, Babar Azam, Rizwan and Shadab Khan. They have got a number of terrific players, particularly in this format of the game. Shaheen would be your No.1 pick, he would be box office,” Moody was quoted as saying to ESPNcricinfo.Additionally, former India batter Sanjay Manjrekar said that tearaway quick Haris Rauf and opening batter Fakhar Zaman would be big buys as well. “One of the best death bowlers, Haris Rauf,” Manjrekar said. “I think about their bowlers more than their batters. But Fakhar Zaman would be an interesting choice in certain teams.”"},
{"title": "There will never ever be another Gayle. Not even Suryakumar...: WI legend", "url": "/cricket/there-will-never-ever-be-another-chris-gayle-not-suryakumar-yadav-universe-boss-smashing-response-india-t20-star-llc-t2-101701004333875.html", "content": "Moving on from a fairly quite ODI World Cup campaign, Suryakumar Yadav has assumed his usual role of grabbing headlines in T20 cricket. On Thursday, four nights after he was part of that heartbreaking World Cup final loss for India, Suryakumar, now as the India stand-in captain for the T20I series against Australia, smashed a thundering 42-ball 80, laced with four maximums and nine boundaries. Three nights later, he carved two sixes in his 10-ball cameo knock of 19 as India attained an early 2-0 lead in the five-match contest.The twin knocks on the back of ODI World Cup show sparked a discussion on the mystery that has been Suryakumar in the two white-ball formats, but it subsequently also reignited talks around the beast that he is in T20 cricket. The India star has found himself often been compared with legendary batters of the format in AB de Villiers, for his 360-degree hitting abilities, while few have hailed him as a \"New Universe Boss\", for his utter dominance, no matter the conditions, no matter the bowling attack, no matter the circumstances. But Chris Gayle, the self-proclaimed 'Universe Boss', didn't seem to like the comparison.Responding to a Hindustan Times query on the sidelines of the Dehradun leg of the ongoing 2023 Legends League Cricket, Gayle indignantly threw his hands up hands in the air and settled the speculation. \"No, there's no other Gayle. There will never ever be another Gayle. There will never ever be. It's only going to be one Universe Boss, just one,\" he stressed.Although Gayle quickly moved on from the subject, he was all praise for India captain Rohit Sharma and his new-look aggressive batting in the ODI World Cup, which played a huge role in the team making that run to the final. En route, he also broke the West Indies legend's record for most sixes in international cricket.Gayle congratulated Rohit, stating, \"I like his aggressive batting. I want batters to destroy bowlers, and Rohit is one of them who does that.\"The 44-year-old also hailed his friend and former IPL teammate Virat Kohli for shattering Sachin Tendulkar's record for most ODI centuries, during the recently-concluded World Cup campaign.When asked by Hindustan Times if he knew back then during his first meeting with Kohli in the Royal Challengers Bangalore camp in 2011 that the star batter would one day rise to the pinnacle in ODI cricket, Gayle smiled and said: \"Absolutely, man. When I was playing for RCB, he was already phenomenal, even in ODI cricket. It was no secret back then. It was all right there in front of all of us, and from there to see him get to the 50th century in ODI cricket, that's unbelievable. To break a legend's record like Sachin, that's fantastic. We have to give the guy as much credit he deserves. That's phenomenal. And I don't see anyone getting close to that or breaking that.\"This is the third time Gayle has been part of the Legends League Cricket. He plays for Gujarat Giants in the franchise format which is hosted in India. But the highlight of his campaign in 2023, as admitted by Gayle, has been opening with South Africa legend Jacques Kallis.\"Cricket is my life, it is in my blood, and it has given me everything. So when you get a chance to play cricket in a league like Legends League Cricket (LLC), it's fantastic to be here. It is a win-win situation for everybody,\" said Gayle. \"Good to be a part of LLC my second stint with them. Good to share the dressing rooms with all the Legends of the game. I get to open the batting with Kallis; it is a great feeling.\""},
{"title": "\"I missed most of World Cup games, was feeling a bit bad\": Ishan Kishan", "url": "/cricket/i-missed-most-of-world-cup-games-was-feeling-a-bit-bad-ishan-kishan-101701086342584.html", "content": "Thiruvananthapuram (Kerala) [India], November 27 (ANI): Indian opener Ishan Kishan said that he missed most of his games in the ICC Cricket World Cup in India this year and though he felt bad about it, he was hungry to make the most of his opportunities in T20Is later after the tournament. India took a 2-0 lead in the five-match T20I series against Australia, and Ishan Kishan played a stellar role, notching up back-to-back half-centuries. He spoke to JioCinema experts in Thiruvananthapuram after the game. \"I think it is all hunger. In the World Cup, we played like a champion side, and I was missing out. I was feeling a bit bad, but you cannot help it. In international cricket, the time will come when you are not playing, but you have to stay fresh in your mind and make it count when the time comes. When you get the opportunity, you have to go for it,\" said Kishan. Kishan played only two matches in the World Cup, scoring a total of 47 runs, including a duck. On using the series as a preparation for the ICC T20 World Cup to be held in June next year, Kishan said that the team has just nine matches before the tournament so they are trying to make the most of their chances. \"At the same time, the match (the second T20I) was fun. There was an expectation that the wicket would turn, but that did not happen because of the dew factor. Going ahead, it is important for us as a young team to analyse the wicket as soon as possible, adapt to the conditions and play accordingly,\" said Kishan. Kishan said that it is fun to bat both as an opener and number three. Kishan batted at number three in both the T20Is, scoring half-centuries. \"It is fun batting both as an opener and at the number three position. At one point, you know the situation the team is in and the kind of game you are expected to play. Today, it was not easy to rotate the strike initially and I struggled a bit in the beginning but the communication was very good with Rutu. We were targeting bowlers and at the same time, when I did not feel like going after a certain bowler, I asked him to go for him. So that is what makes the team different when you communicate well and target bowlers,\" said Kishan. Kishan said that it is important to respect the well-bowled deliveries and take time and Australia comes through with well-prepared plans against all players. \"So, I was just trying to keep it simple. But when the time comes and you have to charge the bowlers, you have to go for it because nowadays we know that in T20 cricket, 170-180 runs are not safe. We were just trying to keep things simple and target the gaps,\" added Kishan.Kishan credited his power-hitting to his dietician and chef. \"I have always been an attacking batsman (talking about his bat swing). When it comes to power-hitting, the credit goes to my dietician and chef. I have hired too many guys, paying a lot of money, so I have to ensure I keep doing the good work,\" said Kishan. In the match, Australia opted to field first. Half-centuries came from Yashasvi Jaiswal (53 in 25 balls, with nine fours and two sixes) and Ruturaj Gaikwad (58 in 43 balls, with three fours and two sixes). These openers put on a stand of 77 runs for the first wicket. Ishan Kishan ended with 52 in 32 balls, with three fours and four sixes.Nathan Ellis (3/45) and Marcus Stoinis (1/27) were among the wickets for the Aussies.Coming to the chase of 236, Australia was off to a terrible start and was reduced to 58/4. An 81-run stand between Marcus Stoinis (45 in 25 balls, with two fours and four sixes) and Tim David (37 in 22 balls, with four boundaries and two sixes) threatened India temporarily, but a fightback by Men in Blue saw them restrict Australia to 191/9 in 20 overs.Ravi Bishnoi (3/32) and Prasidh Krishna (3/41) were the top bowlers for India. Axar Patel, Arshdeep Singh and Mukesh Kumar got one wicket each. (ANI)India will play Australia in the third T20I at Guwahati on Tuesday. (ANI)"},
{"title": "Why Hardik Pandya’s Mumbai Indians ‘homecoming’ was waiting to happen", "url": "/cricket/ipl-2024-why-hardik-pandya-mumbai-indians-homecoming-was-waiting-to-happen-gujarat-titans-101701097978204.html", "content": "“It rang a bell when our head coach told me about the possibility of Hardik Pandya joining our franchise as captain for next year,” said a leading franchise executive. This conversation happened during the last Indian Premier League (IPL) when Gujarat Titans were blazing past opponents in the league phase. Being defending champions and in the middle of another strong run amid stories of how skipper Pandya and coach Ashish Nehra had built the dressing room doing the rounds, “it was hard to believe”, said the official.That information about the all-rounder's switch proved untrue. But people had got a whiff. Then, there were visuals of Hardik being engaged in a conversation with Mumbai Indians owner Akash Ambani during the live telecast of a MI-GT league match in Ahmedabad. GT beat MI in the second qualifier at the same venue to make the 2023 final. How much could one read into those pictures? They may well have been talking about something else. After all, he had played seven seasons for MI, until 2021.But those in the know say it was also a message to GT, ‘what the player wanted’.GT, officials say, had realised well before this year’s IPL that Pandya was not going to be their ‘forever captain’. It isn’t clear exactly when, but Pandya did have a word with his former franchise expressing his desire to go back to MI, where it all began for him in 2015.GT made this known in a statement by Vikram Solanki, their director of cricket. “Hardik has now expressed a desire to return to his original team Mumbai Indians. We respect his decision and wish him all the very best in his future endeavours,” Solanki said.Pandya would never have been added to the auction pool, for there was no guarantee MI would be able to buy him. In that case, the purpose of leaving a successful team would be defeated. GT may have seen the point in not continuing with a reluctant skipper.GT also may have made a few crores more from Pandya’s transfer fee, which has not been made public. But that is not what a franchise that paid 5,625 crore to enter the league was ever going to be after. The point of a trading window is to add heft to your squad strength, and with this trade GT have got the short end of the stick.The sum deducted from the auction purse is all that matters. To have bagged a proven leader and an all-round talent like Pandya for the deduction of only 15 crore; R Ashwin has said on his social media channel: “MI have struck gold”.The BCCI press release on Monday said, “Gujarat Titans captain Hardik Pandya is set to move back to his first franchise, Mumbai Indians, following a trade between the two franchises.”IPL officials confirm that BCCI was, if not party to, kept abreast of the developments given the high stakes at play. MI skipper Rohit Sharma also leads India and Pandya was his deputy in the recent ODI World Cup, until injury forced him out. BCCI will soon be sitting with the selectors to chart the future roadmap on captaincy.The next ICC event is the T20 World Cup to be played in the US and West Indies next June. Pandya, recovering from a tendon tear in the ankle, was leading India’s T20 team through 2023 while Sharma was focused on the ODI World Cup."},
{"title": "\"Unforgettable journey\": Hardik Pandya's emotional goodbye note to Gujarat Titans", "url": "/cricket/unforgettable-journey-hardik-pandya-s-emotional-goodbye-note-to-gujarat-titans-101701094711610.html", "content": "New Delhi [India], November 27 (ANI): Former Gujarat Titans skipper Hardik Pandya extended gratitude to the fans as well as the management for his \"unforgettable journey\" with the franchise after he made a move to the five-time champions Mumbai Indians.After the experienced all-rounder spent two years away from the five-time champions, on Monday, MI confirmed Hardik's return to the franchise. Hardik thanked everyone for the love that he received during his time with GT and wrote on X, \"I want to extend my heartfelt gratitude to the fans, team, and management at Gujarat Titans. Being part of the team and leading it has been an absolute honour, and I am immensely thankful for the love and encouragement my family and I have received as a player and as an individual. The memories and experiences with GT will forever hold a special place in my heart. Thank you for the unforgettable journey.\"The all-rounder spent two momentous years with GT, spearheading their campaign with aplomb. In GT's debut season in 2022, Hardik ensured a fairytale start, with the team lifting the coveted trophy, while they finished runners-up in their second season after a last-ball defeat in a thrilling final earlier this year.In 31 matches for GT, Pandya scored 833 runs at an average of 37.86 and a strike rate of over 133, with six half-centuries and a best score of 87*. He also took 11 wickets for the team, with the best figures of 3/17.Rising youngster Shubman Gill has taken up the mantle which was left empty by Pandya. Gill has amassed 1373 runs in 33 innings at an average of 47.34, with three centuries and eight fifties. Last season was monumental for the opener as he slammed 890 runs in 17 matches at an average of 59.33, with three centuries and four fifties and was also named Orange Cap winner.The opener was instrumental in GT's sensation run since its debut in the IPL. Last season, he smoked 129 runs in 60 balls against Mumbai Indians, the highest by a batter in the IPL playoffs.\"I am delighted and proud to assume the Captaincy of Gujarat Titans and thank the franchise for their trust in me to lead such a fine team. We have had two exceptional seasons and I keenly look forward to leading the team with our exciting brand of cricket,\" Gill said in the announcement. (ANI)"},
{"title": "Time India seek the worldly touch", "url": "/cricket/time-india-seek-the-worldly-touch-101701101934211.html", "content": "Glenn Maxwell standing on one leg to deliver a scintillating double hundred against Afghanistan in Mumbai starts to make more sense once you are told that his highest IPL strike at all venues where he has played at least 10 innings is 178.05, at the Wankhede. A stint with Kolkata Knight Riders could have played a small role in Pat Cummins dismissing David Miller—Gujarat Titans’ trusted finisher in the last two seasons—off a slower short ball with 16 deliveries remaining in the semi-final at Eden Gardens.David Warner—whose 18-ball 29 was half the reason Australia won that semi-final—calls India his second home. Devon Conway and Mitchell Santner bleed yellow for Chennai Super Kings; Quinton de Kock and Marcus Stoinis have been pillars of Lucknow Super Giants while Adam Zampa continues the legacy of the great Shane Warne at Rajasthan Royals. Little wonder then that the aforementioned names find prominent places in the most recent World Cup winning and semi-finalist teams.It’s a different cricket world now with India at its core and the Indian Premier League as its beating heart, attracting the finest from all over the world. These cricketers play dozens of matches, spending nearly three months across several cities, embracing different cultures, exchanging notes and absorbing every byte of information on pitches, outfields, dew and other elements that tend to come into play. With overseas players gaining encyclopaedic knowledge of IPL venues, India is becoming less daunting as a cricketing destination every passing year.The same however can’t be said about Indian players vis-a-vis Australia, England or South Africa because they are not allowed to play in overseas leagues. Yes India are touring more, winning more Tests too, but only a fraction of the Test players figure in all formats. White ball tours—the combination of ODIs and T20Is varies according to the ICC tournament cycle they fall in—these days don’t last more than two weeks and the only multi-team tournament India participate in regularly is the Asia Cup. Compared to a top-tier Indian player thus, globe-trotting Australian, English, South African and New Zealand cricketers have more worldly experience to bank on in ICC tournaments.It can’t be about skill, or else India would have been found out at least once in 10 matches before their World Cup final defeat to Australia. Temperament thus becomes pertinent, especially while comparing them with a bunch of Australians who not only know how to win in India but have also mastered the skill of reading situations equally well, if not better than Indians. Ravichandran Ashwin is the most high-profile name to have brought this to notice by elaborating on his YouTube channel.In a gist, this is what Australia chief selector George Bailey told Ashwin during the mid-innings break of the World Cup final: They chose to chase because red soil (like at the Wankhede) pitches disintegrate but black soil (found in Ahmedabad) ones get better to bat with time. Also, black soil pitches are good turners in the afternoon before turning into solid ‘paata’ pitches—perfect for batting in the second innings. “I was flabbergasted listening to that,” said Ashwin, “seeing all the experience from IPL and the bilateral series and India becoming a central hub of world cricket. They can read the pitch perfectly.”Often losing traction amid the talk of IPL giving overseas players a serious foothold is how less India play away from home these days. In the last five years now, India have hosted Australia in 14 ODIs but played only six bilateral matches away as part of a new broadcaster-supported touring template that makes India the focus of world cricket. What will also be feebly mentioned is Australia winning seven of those 14 matches—just the right win/loss ratio to have kept Australia in the hunt for the World Cup even when it seemed they were not in the running even a month before the tournament began.The 2027 ODI World Cup will be held in South Africa. Two out of the next three T20 World Cups will be hosted jointly by the US and the Caribbean (2024) and then in Australia and New Zealand (2028). Skill not being an issue, the only way India can close in on Australia or South Africa or England is by playing them away from home more often, either through bilateral tours or by playing in overseas franchise leagues. In India’s 10th year without an ICC trophy—the most recent failure coming at home no less—this might well be a point to ponder.Since the ICC is in charge of the Future Tours Programme (FTP) in consultation with the member boards, change in bilateral fixtures would involve other nations too. A simpler solution could be to allow Indian cricketers play in other leagues -- if not all the time, then at least where the next World Cup is scheduled. That the IPL is highly lucrative is an understatement. It offers the best contracts, highest sponsorships and biggest prize money. And the BCCI is completely within its rights to protect its interests and those of the players by limiting the scope of injury considering India’s packed international schedule. But maybe it’s time to reassess that policy.Because preventing Indian cricketers from playing in the Big Bash, The Hundred or the SA T20 league is in its own way limiting their range of experience against different opponents and in different situations in the longer run. Having Indians play abroad isn’t a difficult scenario to envisage nowadays, with IPL franchises picking up stakes in almost every overseas league.All they now need is an NOC from the BCCI for, say, Jasprit Bumrah to turn out for MI Cape Town or Rishabh Pant for Pretoria Capitals. Imagine them passing on information about Newlands, Wanderers and Centurion during the 2027 World Cup, knowledge that can’t be gained in a few bilateral one-dayers. Now wouldn’t that be a great advantage?"},
{"title": "Hardik's 'heartfelt' goodbye message for Gujarat Titans post Mumbai Indians move", "url": "/cricket/hardik-pandya-pens-heartfelt-goodbye-message-for-gujarat-titans-after-mumbai-indians-move-ahead-of-ipl-2024-101701092064201.html", "content": "India all-rounder Hardik Pandya on Sunday moved back to Mumbai Indians ahead of the 2024 season of the Indian Premier League (IPL) after having completed two fabulous seasons as a captain of the Gujarat Titans. The development came hours after the 2022 IPL champions retained their skipper before MI completed the trade. Following the announcement, Hardik left a heartfelt goodbye message for the Titans.After being shockingly released from Mumbai ahead of the 2022 season, Hardik was roped in by Gujarat Titans and announced their skipper. He then led the debutants to a stellar title win that season, while they ended as runner-up in the 2023 season, losing to Chennai Super Kings in the final. In those two seasons, he scored 833 runs in 30 innings at 41.65 while also picking 11 wickets at almost eight an over.On Monday, hours after his Mumbai Indians deal was officially announced, Hardik penned an emotional note for his former franchise, Gujarat Titans.“I want to extend my heartfelt gratitude to the fans, team, and management at Gujarat Titans. Being part of the team and leading it has been an absolute honour, and i am immensely thankful for the love and encouragement my family and i have received as a player and as an individual. The memories and experiences with GT will forever hold a special place in my heart. Thank you for the unforgettable journey,” he shared on X.Hardik was previously part of of Mumbai Indians between 2015 and 2021 where he won four titles as a player. It was in MI where Hardik gained fame for hos all-round abilities that later helped him crack and eventually cement his place in the Indian team.\"We are thrilled to welcome Hardik back home! It's a heartwarming reunion with our Mumbai Indians family,\" Nita M Ambani, owner of Mumbai Indians, said. \"From being a young scouted talent of Mumbai Indians to now being a team India star, Hardik has come a long way and we're excited for what the future holds for him and Mumbai Indians!\""},
{"title": " India vs Australia Live Score, 3rd T20I: IND seek series win", "url": "/cricket/india-vs-australia-live-score-t20-series-2023-today-28-november-ind-vs-aus-3rd-t20-match-in-barsapara-stadium-guwahati-101701164762529.html", "content": "India have chased and defended succesfully thus far and they now stand on the brink of sealing a third consecutive T20I series win against Australia. The hosts go into the third T20I against Australia with a 2-0 lead in the five-match series. India,  India had won the first match while chasing and defended a mammoth total in the second. They broke the record for India's highest T20I run chase against Australia in the first game in Visakhapatnam. Australia had scored 208/3 in the first game with Josh Inglis scoring 110 in just 50 balls. India's chase was fuelled by half-centuries from Suryakumar and Ishan Kishan before Rinku pulled them over the line off the last ball of the match. In the second, Yashasvi Jaiswal, Ruturaj Gaikwad, and Ishan Kishan all blazed half-centuries while Rinku hammered an unbeaten 31 in just nine balls as India put up a total of 235/4. Prasidh Krishna and Ravi Bishnoi then took three wickets each as Australia were restricted to a score of 191/9.The players received a warm welcome at Guwahati airport and at their hotel. Youngsters Rinku Singh, Yashasvi Jaiswal and Ravi Bishnoi have stepped up for the team in both matches, while, Suryakumar with his experience has contributed with the bat and added the finishing touches to India's innings.- India won the first T20I by two wickets and the second by 44 runs- India have won their won their last two T20I series against Australia- The last time Australia beat India in a T20I series was in 2019- Australia last lost three T20Is on the trot in 2021- Suryakumar Yadav is 60 runs away from becoming the fourth Indian to score 2000 T20I runsIndia vs Australia Live Score, IND vs AUS T20 Series: India keep Zampa quietIndia vs Australia Live Score, IND vs AUS T20 Series: Leading up to this series, Adam Zampa had taken 12 wickets in 14 matches against India. Zampa ended up going wicketless in the second T20I.India vs Australia Live Score, IND vs AUS T20 Series: Rinku Singh's late boostsIndia vs Australia Live Score, IND vs AUS T20 Series: Rinku Singh's penchant for wringing the most out of the last few balls of an innings has been on full display in this series. His strike rate of 344 in the second T20I was the highest by a batter in matches between India and Australia. The previous landmark was 288.88 when Shikhar Dhawan smashed 26 from nine balls at the SCG in 2016.India vs Australia Live Score, IND vs AUS T20 Series: Australia full squadIndia vs Australia Live Score, IND vs AUS T20 Series: Matthew Short, Travis Head, Josh Inglis, Glenn Maxwell, Marcus Stoinis, Tim David, Matthew Wade(w/c), Sean Abbott, Nathan Ellis, Tanveer Sangha, Jason Behrendorff, Aaron Hardie, Kane Richardson, Ben McDermott, Josh PhilippeIndia vs Australia Live Score, IND vs AUS T20 Series: India full squadIndia vs Australia Live Score, IND vs AUS T20 Series: Yashasvi Jaiswal, Ruturaj Gaikwad, Ishan Kishan(w), Suryakumar Yadav(c), Rinku Singh, Tilak Varma, Axar Patel, Ravi Bishnoi, Arshdeep Singh, Mukesh Kumar, Prasidh Krishna, Avesh Khan, Jitesh Sharma, Washington Sundar, Shivam DubeIndia vs Australia Live Score, IND vs AUS T20 Series: Hello and welcome!India vs Australia Live Score, IND vs AUS T20 Series: The young Indian team have shown that they are as good as any the country has put out to face Australia in a T20I series in the post. They secured a last-ball win a thriller of a first T20I and then blazed 235 runs batting first in the second. Now, they are standing on the precipice of sealing a win in the five-match series."},
{"title": "What the Hardik Pandya trade means for Mumbai Indians and Gujarat Titans", "url": "/cricket/ipl-2024-what-the-hardik-pandya-trade-means-for-mumbai-indians-and-gujarat-titans-101701098367317.html", "content": "With the exception of Hardik Pandya, it's difficult to find an Indian cricketer who can swing the new ball, hit hard lengths in the middle, guarantee a full bowling quota, anchor the batting at No 4; or when required, bat down the order, go deep inside the crease and send the ball sailing into the stands. Not just that, with proven IPL captainship credentials, also ead the Indian team in T20 cricket.Even on the current IPL canvas where the Impact player rule has somewhat diluted the value of an all-rounder, Pandya remains a high-end stock. It was a fact that he knew and it allowed him to get the best deal for himself. If that meant moving away from Gujarat Titans, a franchise where he revived his white-ball career, so be it.GT should know. Speaking in his deep voice for a GT promo which was released when he was appointed captain, Pandya would say, he was chasing the peak called ‘sporting success’; a journey which would sometimes pit him against ‘siblings, soulmates and many close friends’.Pandya is a Mumbai Indian again. Their scouts had identified him like a multibagger stock, before he was picked up in the 2015 auction for a base price of 10 lakhs. Pandya’s return is being billed as a homecoming. But who is to judge, if Pandya’s here to boost his emotional quotient. The star all-rounder sees a better future for himself with his new-old franchise.It’s a testament to GT’s squad formation skills that the make-up of their first team, other than Pandya, is likely to remain unaffected. They were quick to award the captaincy to Shubman Gill, who they had drafted in after he was released by Kolkata Knight Riders, where his batting strike rate was questioned.“Shubman has growth in stature and standing over the last two years at the highest level of the game. His maturity and skill is evident in his on-field performance and we are extremely excited to embark on a new journey with a young leader like Shubman at the helm,” Vikram Solanki, Director of Cricket, Gujarat Titans said in a statement.2023 has also been Gill’s breakthrough year in T20 cricket. With Indian cricket expecting bigger things from him, he can only better his batting skills from here.Sai Sudharshan, who bats at No 3 for GT has also grown in stature, having impressive outings; both in the Indian domestic circuit for Tamil Nadu and for Surrey in county cricket. From GT’s twelve that played in the final against Chennai Super Kings, David Miller is still scoring big, Mohammed Shami is picking wickets in a heap, Noor Ahmed remains difficult to pick and Rashid Khan is peerless. Rahul Tewatia and Vijay Shankar come with limitations but the Impact player rule allows them to be utilized smartly.GT would perhaps be anxious about a couple of their old war-horses Wriddhiman Saha and Mohit Sharma, whether they still have it. They may look for some back-ups for them in the auction.So strong was GT’s Indian core that they played only three overseas players in their twelve at the final. Matthew Wade, who is leading Australia in the ongoing series, can easily come in. For now, they also have Kane Williamson who can bat at No 3 or 4. But to fill the Pandya-sized hole, GT strategists will have to be at their best on the auction table.For Mumbai Indians, Pandya returns for a long-term captainship role. Whether he gets to lead immediately, will also depend on the talks the franchise has with their five-time title winning captain Rohit Sharma.MI owner Nita Ambani called Pandya’s return ‘a heartwarming reunion’. Sharma was named as MI’s captain when the retainership list was released on Sunday. But Sharma’s long-term plans as an India player and what discussions he has with the Indian selectors and the BCCI will have to be watched. If the selectors want Pandya to lead India in the upcoming T20 World Cup, would that have any bearing on what MI decide?What Pandya’s return does is immediately improve the balance of MI’s playing eleven. Most of Cameron Green’s success last year came batting in the top order. With the Australian all-rounder now traded to RCB, MI have in Sharma, Ishan Kishan and Suryakumar Yadav a stable top three. Hardik will combine with Tim David and young Nehal Wadhera to try and recreate the kind of impact he had with Krunal and Kieron Pollard in the middle and back-end of an innings.If fully fit, Pandya’s overs will certainly help. But MI have never been able to offer the desirable bowling back-up to Jasprit Bumrah, after Lasith Malinga and Mitchel Jhonson moved on and later after losing Trent Boult.With their remaining 15 crore worth of purse, the amount that was deducted to regain Pandya’s services, they will need to have a good auction day. It may also be down to their scouting teams if they can unearth another multibagger stock."},
{"title": "Sikandar Raza's heroics guide Zimbabwe to win, Namibia register comprehensive victory in T20 World Cup Qualifiers", "url": "/cricket/sikandar-raza-s-heroics-guide-zimbabwe-to-win-namibia-register-comprehensive-victory-in-t20-world-cup-qualifiers-101701102417510.html", "content": "Windhoek [Namibia], November 27 (ANI): Namibia and Zimbabwe secured crucial victories against Kenya and Rwanda respectively on Monday in the ICC Men's T20 World Cup Africa Region Qualifier.A disciplined Namibia bowling line-up made Kenya toil hard in the early overs. Kenya lost openers Rushabhvardhan Patel (1), Collins Obuya (15), and Pushkar Sharma (5) for paltry scores.Irfan Karim (43*) and Sachin Bhudia (18) came together to stabilise the innings with their crucial knocks. However, the lack of firepower in the final phase resulted in Kenya finishing the innings at 104/6. While chasing 105, Namibia added 20 runs for the first wicket, Michael van Lingen was the first player to fall after edging the ball which was taken behind the wicket.In the subsequent overs, Namibia lost three more wickets in a space of just 27 runs. It seemed as if Kenya had found a way to sneak back in, Jan Frylinck (57*) and JJ Smit (14*) put a halt in their attempt and put in a quick-paced match-winning stand of 59 runs. With this win, Namibia sit at the top of the Africa Region Qualifier points table. They have four wins from four contests and have eight points to their name. Despite losing this game, Kenya managed to hold on to their second place with six points.In the second game of the day, Zimbabwe won by 144 runs against Rwanda. After suffering a shocking defeat to Uganda, Zimbabwe's aspirations to qualify for the T20 World Cup were challenged, but they produced a good brand of cricket against Rwanda to keep their chances of qualification alive.Zimbabwe's experienced all-rounder Sikandar Raza led the charge with a special performance with both bat and the ball. Leading from the front, the skipper opened the batting and hit a quick-fire 58 in 36 balls.His knock was graced with six fours and four sixes. His partner on the other end, Tadiwanashe Marumani matched Raza and added 50 from 31 balls with the help of three fours and three sixes.Brisk contributions from Ryan Burl (44* from 21) and Luke Jongwe (17* from 4) in the death overs, helped Zimbabwe to 215/4.Raza continued his stunning form and did serious damage with the ball. His efforts ensured that the Rwanda chase was never able to spread its wings right from the kick-off. While Richard Ngrava (3/11), and Blessing Muzarabani (1/10) did the early damage, Ryan Burl (2/7) hit the middle-order with his clinical spell. Raza came in and finished the game once more for Zimbabwe. He wiped off the tail with a hat-trick in the 19th over to finish the game with a figure of 3/3.Despite this win, Zimbabwe sit in the fourth spot with only four points on the table and needs other results to fall their way in order to qualify. Uganda hold the second spot with six points and a net run rate of 0.503. (ANI)"},
{"title": "\"We love, prioritize Test cricket\": New Zealand skipper Tim Southee ahead of Bangladesh series", "url": "/cricket/we-love-prioritize-test-cricket-new-zealand-skipper-tim-southee-ahead-of-bangladesh-series-101701098461212.html", "content": "Sylhet [Bangladesh], November 27 (ANI): New Zealand Test skipper Tim Southee is excited to kick off the new cycle of the World Test Championship with a two-match series against Bangladesh on Tuesday at the Sylhet International Cricket Stadium. \"The guys have a great desire for Test cricket. They say it is the pinnacle of the game. Whenever we do play Test cricket, it is always special. We love and prioritize Test cricket,\" said Southee in the pre-match press conference.The Kiwis had a brief pause in the red-ball cricket as they appeared donning the white jersey at the beginning of this year against Sri Lanka and England. Despite having such a hiatus in the longest format of cricket, Southee was upbeat on the eve of the first Test and is looking to do well in the new WTC cycle. \"The start of the new cycle is exciting. It is a tough place to play Tests. Bangladesh is strong in these conditions. We played Tests back at the start of the year. The last cycle didn't go as well as we planned. The guys involved in the first WTC cycle know how special it is to do well in this championship,\" Southee added. New Zealand will be challenged by the Bangladesh team on a surface that will be a complete contrast to their home conditions. The pace bowling unit has been their strength in the red ball format, but Southee has backed the spinners to turn up in the sub-continent. \"We took a little look at the wicket. There hasn't been a lot of Test matches here. So there's not a lot of information and statistics to go back on. I think we are expecting a pretty good surface. Of course, spin will play a part in the match. We played in Pakistan earlier this year. The guys now have a lot of experience in the sub-continent,\" Southee said. \"It is foreign conditions compared to New Zealand. Pace plays a big role in New Zealand. Spin historically plays a big role in this part of the world. Our spinners have done some great things in Tests. We are looking forward to them showcasing their skills,\" Southee added. One of the major drawbacks for Bangladesh will be turning up without their star players Shakib Al Hasan and Litton Das. Shakib sustained an injury during the recently concluded OCI World Cup while Litton is on a month's paternity leave after he and his partner were blessed with a child recently.While commenting on whether New Zealand will get benefit from the absence of both players, Southee said, \"Shakib has been a great player for Bangladesh for a long time. Litton Das is a class player. He has done well against us in the past. I guess it is a miss for them not having those guys. It gives opportunities to other guys to step in positions that have been occupied by those two guys.\"New Zealand squad: Tim Southee (c), Tom Blundell (wk), Devon Conway, Kyle Jamieson, Tom Latham, Daryl Mitchell, Henry Nicholls, Ajaz Patel, Glenn Phillips, Rachin Ravindra, Mitchell Santner, Ish Sodhi, Neil Wagner, Kane Williamson, Will Young. (ANI)"},
{"title": "Can India's youngsters keep the big stars out?", "url": "/cricket/can-indias-youngsters-keep-the-big-stars-out-101701102445299.html", "content": "Hard as bouncing back from defeat in a World Cup final is, the performances of India’s young brigade in the first two T20Is against Australia should provide some solace. Whether it is the lower order pyrotechnics of Rinku Singh, the explosive opening from Yashasvi Jaiswal or the growing stature of Tilak Varma in the middle order, what the series — never mind the absurdity of one so soon after a taxing ODI World Cup campaign — is establishing are the exciting options at India’s disposal going into next year’s T20 World Cup. With the calendar hurtling along at relentless pace, these matches may not register in the mind of the fatigued viewer, but the selectors and the team management will be taking note.But to what extent? If Jaiswal and Ruturaj Gaikwad keep performing well in the opportunities presented, should they be preferred over Rohit Sharma and Shubman Gill at the top of the order? Will Rinku and Varma find places in the middle order when Hardik Pandya and KL Rahul are also available for selection? How does leg-spinner Ravi Bishnoi, who has taken four wickets in two matches, stack up against, say, Kuldeep Yadav or Yuzvendra Chahal?Discussions of this nature are bound to crop up when players in India’s second-string team come to the fore. Caveats are of course necessary – the Australians are also not fielding their first-choice eleven and the first two games of this series have been on flat decks suitable for belligerent strokeplay. But if Jaiswal, Gaikwad, Rinku and Varma – just to name a few in India’s vast talent pool -- are being considered capable of slotting into India’s strongest T20 team, it's because they have offered more than just flashes of their talent in recent months.Jaiswal was the fifth-highest run-getter in the IPL this season – he scored 625 runs in 14 games at an average of 48.07 and a strike rate of 163.61. In the process, he even overshadowed Jos Buttler, often outscoring his senior partner during their fast-paced opening stands for Rajasthan Royals. While translating IPL success into performances at the highest level isn't straightforward, Jaiswal’s international career took off almost instantly, smashing an unbeaten 84 against West Indies in just his second T20I. Considered to be more geared towards the longer format when he first rose to prominence in the 2020 U-19 World Cup, Jaiswal has shown the range of an all-format batter. It should be noted that he made a 387-ball 171 on his Test debut in July.In the second T20I in Thiruvananthapuram on Sunday, the 21-year-old cracked 53 off just 25 deliveries as India raced to 77 in the first six overs. There were sweeps, lofted drives and power-packed pulls in Jaiswal’s enterprising knock, enabling just the sort of beginning that India will be seeking in the Caribbean next year.“It was really special for me. I was trying to play all my shots, be fearless, take bowlers on. I was fully sure with my decisions,” Jaiswal said after the match on Sunday. “I have been told by (captain) Suryakumar (Yadav) and (coach) VVS (Laxman) bhai to express myself. I always think of how I can improve myself around experienced players and nothing else. Still learning.”If Jaiswal sparked the opening onslaught, the finishing fillip was provided by Rinku. He clobbered four fours and two sixes in nine deliveries, taking India to 235/4. The 26-year-old is just seven T20Is old, but a breakout IPL season with Kolkata Knight Riders – his 474 runs in 14 matches at a strike rate of 149.53 included pulling off a heist against Gujarat Titans with five sixes in the last over – has gone a long way towards highlighting his prowess in the death overs. Furthermore, he’s striking at 199.49 in overs 16-20 in T20Is this year, better than any Indian batter.Very few are able to combine a vast hitting range with the unflappable temperament needed to succeed in these situations. As Rinku has revealed, advice from MS Dhoni seems to be coming in handy. “As for my secret to calmness, I had discussions with Mahi (Dhoni) bhai about what he does to stay calm, especially in the last over,” Rinku was quoted as saying in a BCCI video after victory in the first T20I against Australia.Varma has also evoked awe with moments of brilliance in his fledgling international career. With his game blending elegance and power in the right doses, Varma has impressed to such an extent that he’s seen as a fulcrum of the Mumbai Indians middle order for the next decade. In the past two seasons, Varma, 21, has aggregated 740 runs in 25 IPL games at a strike rate of 144.53, earning the plaudits of Sharma and former India coach Ravi Shastri among others.“I’m very impressed with Tilak Varma. Whether it was for Mumbai Indians, for India, whether it was handling pressure, opposition, or different situations of the game, he has ticked all the boxes for someone so young. When it comes to shot selection, when it comes to the range of shots, and the ability to be unorthodox, he has everything,” Shastri had told Star Sports in August.Still, India’s top players, who may be resting for the T20 series against Australia, will invariably be in the fray for the T20 World Cup. Simply by virtue of their top-notch track record, built over years of consistency and exposure to different situations. When Mitchell Starc is charging in at full tilt with the new ball in hand, can you discount Sharma’s calibre? When 30 runs are needed from two overs against two top death bowlers, would it be Rinku or someone more experienced that you would want on strike?Ultimately, the selectors will have to strike a balance. Because while you always want big names to flex their muscle for a big event, you also have to reward fresh faces making a strong case series after series."},
{"title": "Abu Dhabi T10 2023 kicks off tomorrow", "url": "/cricket/abu-dhabi-t10-2023-kicks-off-tomorrow-101701107794998.html", "content": "Abu Dhabi [UAE], November 27 (ANI): In anticipation of another season of cricket's fastest format, Abu Dhabi T10 2023 edition, announced the captains for the season at a press conference held in Sheikh Zayed Cricket Stadium in Abu Dhabi.West Indies heavy hitter Nicholas Pooran, who led Deccan Gladiators to a title win in the previous edition has been retained as a Captain by the defending Champions for the upcoming seventh edition, which will take place between November 28 and December 9.The runners-up of last season New York Strikers and Morrisville Samp Army will also continue with veteran allrounders Kieron Pollard and Moeen Ali as Captains, respectively.The remaining teams made a change in leadership as Sikandar Raza handed over the reins for The Chennai Braves to Charith Asalanka, whilst Northern Warriors named Angelo Mathews as Captain, and Delhi Bulls named Rovman Powell as skipper for the season. Team Abu Dhabi picked Dwaine Pretorius to lead the side whilst Bangla Tigers made a surprise pick in Benny Howell as Captain, according to a release.All the Captains, in attendance at the press conference, made their intentions clear for the season. Pooran, who was also the highest run-scorer of the last season with 345 runs in 10 matches at an average of 49.29 and a strike rate of 234.69, said that he wishes to win the record third title for Gladiators this season.\"It was a good season for me the last time around, and I was happy to contribute to the team's success, not only as Captain but also as a batsman. Our target this year is to retain the trophy and we will continue to play the kind of cricket we like to play. It would be an honour for me to lead Gladiators to a record third title this time around. I am ready to take up any role the team wants me to,\" Pooran said.Presently, Gladiators and Northern Warriors are the only two teams to have won two titles. The Warriors have made a strong choice in Mathews as skipper, who has been one of the most successful Captains for Sri Lanka in international cricket.\"I am grateful to be considered to lead Northern Warriors, a franchise that has already achieved massive success in this league. Warriors have already won two trophies and I would love to bring the trophy back to the team so that we all can script history together. This is an exciting format, and the fans can expect big things from our side in the 7th season,\" Mathews said.Meanwhile, Strikers and Morrisville will look to use Pollard and Moeen's familiarity with the format once again to boost their chances of getting their hands on the trophy. Pollard said he wants to finish the job this season.\"We came so close to winning the title last season, but the final was a lesson for us. We now know the temperament that is needed in big matches, and we will look to use that knowledge to our advantage. We have a solid squad, and we are ready to go all the way this time,\" he said.Moeen Ali said that such a quick format is a test of players' skills. \"While one may feel that T10 is all about big shots, and heavy hitting, it is also about recognising and adapting to situations quickly and efficiently when you are out there. In such a short time, anything can happen. We must be ready for Plan A, Plan B, and Plan C and if we do that, we will be in a good position to win the whole thing.\"Meanwhile, Sri Lanka top-order batter Asalanka will be leading the side in place for Raza, and he admitted he has big shoes to fill. \"Sikandar Raza enjoys a massive fan following and support in this part of the world. I am excited to take over the reins as Captain for the Braves and will look forward to leading the team. We must take one game at a time, but our goal is to make the playoffs and set ourselves up for a chance to play in the all-important Final.\"Delhi's choice of giving Captaincy to Powell is another interesting move as the West Indies batting allrounder led Northern Warriors last season and scored 196 runs in 7 matches at a whopping strike rate of 245.\"I was in good form in the previous edition and also gained experience in leading a team in this format. Now, with a new squad and a new franchise, I am even more motivated to perform. We want to see Delhi Bulls get their hands on the trophy once again - and we must stick to our plans in order to do so,\" Powell said.Team Abu Dhabi decided to put their stocks on bowlers during the draft, and backing their bowling unit, named South Africa speedster Pretorius as the Captain. In 10 games last season, Pretorius was the leading wicket-taker with 12 scalps to his name at an average of 13.08.\"This is a good chance for me to change the mindset that short formats are only for the batters. The bowlers also have an equally important role to play, especially fast bowlers who start the attack with the new ball. They have very little time to get used to the track and implement their plans and get crucial wickets in the first three overs, and that is what we will try to do in every game,\" Pretorious said.Bangla Tigers, meanwhile, have named veteran English domestic talent Benny Howell and are banking on his experience to make their way into the top four.\"I am delighted to lead Bangla Tigers as Captain this year. It is an important year for us - as we want to make it to top four. We have an impeccable squad, but we will have to work together as a collective unit. If we can all perform to our abilities, we are hard to beat,\" he signed off. (ANI)"},
{"title": "Gill speaks up after being made captain of Gujarat Titans: 'To all the fans…'", "url": "/cricket/shubman-gill-speaks-up-after-being-made-captain-of-gujarat-titans-ipl-2024-to-all-the-fans-101701093337202.html", "content": "Shubman Gill has been announced as the Gujarat Titans' new captain after all-rounder Hardik Pandya's shock return to the Mumbai Indians. While Pandya was in the list of players retained by GT on Sunday, it was announced on Monday that he had been traded to MI, with no player going the other way.Shortly after the news was made official on Monday, GT announced 24-year-old Gill as their new captain. “I am proud to assume the Captaincy of Gujarat Titans and I cannot thank the franchise enough for their trust in me to lead such a fine team. Let’s make it memorable! To all the fans… #AavaDe!” said Gill on X.Gill had played a pivotal role in GT winning the title in 2022 and won the Orange Cap last season. GT director of cricket Vikram Solanki said that the batter has \"shown growth in stature and standing over the last two years at the highest level of the game.\"\"We've seen him mature not only as a batter but also as a leader in cricket. His contribution on the field has helped Gujarat Titans emerge as a formidable force, guiding the team through a successful campaign in 2022 and a strong run in 2023. His maturity and skill is evident in his on-field performance and we are extremely excited to embark on a new journey with a young leader like Shubman at the helm,\" said Solanki.Gill, with 890 runs at an average of 59.33 from 17 matches was the leading scorer at last IPL - the second-highest of all time behind Virat Kohli's tally of 973 - and with a prolific record in 2023 behind him, was the most obvious choice for the post. Kane Williamson was another name that was doing the rounds, but the franchise felt who better to represent them than the future face of Indian cricket and a captain in the making."},
{"title": "Gladiators captain Pooran, Warriors skipper Mathews eye 3rd Abu Dhabi T10 title", "url": "/cricket/deccan-gladiators-captain-nicholas-pooran-northern-warriors-skipper-angelo-mathews-eye-record-third-abu-dhabi-t10-title-101701151332122.html", "content": "In anticipation of another explosive season of cricket's fastest format, the Abu Dhabi T10 2023 edition, announced the captains for the season at a press conference held in Sheikh Zayed Cricket Stadium in Abu Dhabi. West Indies big-hitter Nicholas Pooran, who led Deccan Gladiators to a title win in the previous edition, has been retained as captain by the defending champions for the upcoming seventh edition, which will take place between November 28 and December 9. The runners-up of last season, New York Strikers and Morrisville Samp Army will also continue with veteran allrounders Kieron Pollard and Moeen Ali as Captains, respectively.The remaining teams made a change in leadership as Sikandar Raza handed over the reins for The Chennai Braves to Charith Asalanka, whilst Northern Warriors named Angelo Mathews as captain, and Delhi Bulls named Rovman Powell as skipper for the season. Team Abu Dhabi picked Dwaine Pretorius to lead the side whilst Bangla Tigers made a surprise pick in Benny Howell as their captain.All the captains made their intentions clear for the season. Pooran, who was also the highest run-scorer of the last season with 345 runs in 10 matches at an average of 49.29 and a strike rate of 234.69, said that he wishes to win the record third title for Gladiators this season.“It was a good season for me the last time around, and I was happy to contribute to the team’s success, not only as Captain but also as a batsman. Our target this year is to retain the trophy and we will continue to play the kind of cricket we like to play. It would be an honour for me to lead Gladiators to a record third title this time around. I am ready to take up any role the team wants me to,” Pooran said.Presently, Gladiators and Northern Warriors are the only two teams to have won two titles. The Warriors have made a strong choice in Mathews as skipper, who has been one of the most successful Captains for Sri Lanka in international cricket.“I am grateful to be considered to lead Northern Warriors, a franchise that has already achieved massive success in this league. Warriors have already won two trophies and I would love to bring the trophy back to the team so that we all can script history together. This is an exciting format, and the fans can expect big things from our side in the 7th season,” Mathews said.Meanwhile, Strikers and Morrisville will look to use Pollard and Moeen’s familiarity with the format once again to boost their chances of getting their hands on the trophy. Pollard said he wants to finish the job this season.“We came so close to winning the title last season, but the final was a lesson for us. We now know the temperament that is needed in big matches, and we will look to use that knowledge to our advantage. We have a solid squad, and we are ready to go all the way this time,” he said.Moeen Ali said that such a quick format is a test of players’ skills. “While one may feel that T10 is all about big shots, and heavy hitting, it is also about recognising and adapting to situations quickly and efficiently when you are out there. In such a short time, anything can happen. We must be ready for Plan A, Plan B, and Plan C and if we do that, we will be in a good position to win the whole thing.”Meanwhile, Sri Lanka top-order batter Asalanka will be leading the side in place for Raza, and he admitted he has big shoes to fill. “Sikandar Raza enjoys a massive fan following and support in this part of the world. I am excited to take over the reins as Captain for the Braves and will look forward to leading the team. We must take one game at a time, but our goal is to make the playoffs and set ourselves up for a chance to play in the all-important Final.”Delhi’s choice of giving Captaincy to Powell is another interesting move as the West Indies batting allrounder led Northern Warriors last season and scored 196 runs in 7 matches at a whopping strike rate of 245. “I was in good form in the previous edition and also gained experience in leading a team in this format. Now, with a new squad and a new franchise, I am even more motivated to perform. We want to see Delhi Bulls get their hands on the trophy once again – and we must stick to our plans in order to do so,” Powell said.Team Abu Dhabi decided to put their stocks on bowlers during the draft, and backing their bowling unit, named South Africa speedster Pretorius as the Captain. In 10 games last season, Pretorius was the leading wicket-taker with 12 scalps to his name at an average of 13.08.“This is a good chance for me to change the mindset that short formats are only for the batters. The bowlers also have an equally important role to play, especially fast bowlers who start the attack with the new ball. They have very little time to get used to the track and implement their plans and get crucial wickets in the first three overs, and that is what we will try to do in every game,” Pretorious said.Bangla Tigers, meanwhile, have named veteran English domestic talent Benny Howell and are banking on his experience to make their way into the top four. “I am delighted to lead Bangla Tigers as Captain this year. It is an important year for us – as we want to make it to top four. We have an impeccable squad, but we will have to work together as a collective unit. If we can all perform to our abilities, we are hard to beat,” he signed off."},
{"title": "All hell breaks loose at Bumrah's cryptic 'silence' post ahead of IPL auction", "url": "/cricket/jasprit-bumrah-of-mumbai-indians-posts-cryptic-instagram-story-about-silence-ahead-of-ipl-2024-auction-101701156459779.html", "content": "An Instagram story posted by  about 'silence' on Tuesday has caused all sorts of chaos among fans on social media. A day after  to  franchise  was confirmed on Monday, Bumrah's cryptic post has led to all kind of speculations. Bumrah's post reads 'Silence is sometimes the best answer', and while nothing concrete can be made of it, fan theories have started running rampage, most of which hint at a possible rift between the two parties.Some have shared screenshots of Bumrah unfollowing MI on Instagram, while others believe his new home is down south at the Royal Challengers Bangalore. A section of fans believe Hardik's return to MI threw a spanner in the pacer's desire of becoming the captain after Rohit Sharma steps down, whereas a sensible fragment reckons there's no need to read between the lines.However, the fact is that Bumrah has been an integral part of MI. He has has been with them since the very beginning of his IPL career – back in 2015 – has picked 145 wickets at an average of 23.30 and been part of four IPL title winning campaigns in 2015, 2017, 2019 and 2020. Having said that, social media is a platform where the people share snippets of their wildest imaginations and this is no different.Bumrah, who missed the entire IPL 2022 due to his back injury, was retained by MI during the official player retention show on Sunday. They traded Cameron Green, whom they picked at last year's auction for 17.5 crore to RCB, and released Jofra Archer as the speedster continues to be pinned down by injuries. Green's trade came as somewhat of a surprise as he played all 16 matches last season and scored 452 runs from 16 matches including an unbeaten century. He also picked six wickets. The only logical explanation to this is Hardik's re-entry. Both play a similar role and with the India T20I captain being an expensive buy, Green's time was up.Although Bumrah has been retained, there is a possibility of him being traded to another team as the window for the same closes on December 12, a week before the IPL 2024 player auction on December 19. Hardik's return to MI followed a similar pattern. Initially listed in Gujarat Titans' retained players on Sunday, he officially rejoined the franchise where his journey began in 2015 just a day later.Other players released by MI include Tristan Stubbs, Duan Jansen, Jhye Richardson, Ramandeep Singh, Raghav Goyal, Arshad Khan, Hrithik Shokeen, and Sandeep Warrier (brought in as a replacement for Bumrah). Additionally, Chris Jordan was signed as a replacement for Archer, Riley Meredith replaced Jhye Richardson, and Cameron Green was traded to RCB."},
{"title": "‘Want to get reunited with MI’: After Hardik, another IPL champion eyes return", "url": "/cricket/after-hardik-pandya-another-ex-mumbai-indians-player-mitchell-mcclenaghan-eyes-ipl-return-in-a-new-role-101701107347467.html", "content": "Stepping out of his comfort space,  walked the talk of India wanting to play aggressive cricket throughout the 2023 ODI World Cup. Playing to his 'Hitman' moniker, Rohit's plan stayed simple - set the perfect platform for the middle order to take over with some swashbuckling strokes which would in turn dampen the confidence of the opposition bowling attack early on as well, allowing the remaining batters to flourish. The game plan played a pivotal role in India's unbeaten run to the final and looked almost perfect in the final as well before India faltered and crumbled against Australia.Irrespective of the results, Rohit was hailed for his captaincy and batting by veteran cricketers, including his former Mumbai Indians teammate . Responding to a query from Hindustan Times on the sidelines of the Dehradun leg of the ongoing 2023 Legends League Cricket, the ex-New Zealand player, who played six seasons under Rohit's captaincy in IPL between 2015 and 2020, opened up on the immense effort that the India star puts in major tournaments and hence felt that he \"deserved the World Cup\".He said: \"I feel really bad for Rohit in particular because I know how much preparation he puts into tournaments, and I know this would have been a big trophy for him to tick off. So from that point of view, I do place my heart, I feel, for how he didn't get the result that he would have wanted and what he probably deserved with how he has turned Indian cricket around in the last couple of years.\"Roped in ahead of the 2015 season, McClenaghan played a pivotal role in three of Mumbai Indians' titles during his six-year stint in IPL. He picked up 71 wickets in 56 appearances before being released after the 2020 season. After the announcement from MI, the left-arm fast bowler had thanked the franchise before adding, \"It's a see you later, not a goodbye\".When asked by Hindustan Times whether the post, made in 2021, still holds relevance with McClenaghan looking for a mentorship role perhaps, the four-time IPL winner revealed that he has been taking coaching courses post his retirement and has the target of an MI reunion soon.\"It's one of the common things get on Twitter, people asking when I'm coming back, but currently I am going through my coaching courses, trying to learn more about that side of the game because it's a sport that I enjoy and a sport that I would like to be involved in going forward. So whether that goes locally back home or globally within the T20 circuit, and who knows? I mean, MI would be a goal of mine to reunite with that franchise, for sure,\" he smiled.In the ongoing LLC, where he plays for Manipal Tigers, McClenaghan is also fulfilling his childhood dream of playing against South African legend Jacques Kallis.\"You have an incredible number of players who have just retired. So it is just an incredible concept of playing cricket post-retirement,\" the Kiwi pacer said. \"For me too, look, I got to play against Jacques Kallis, he is someone I admired while I was growing up. Unfortunately, careers never crossed over, so I didn't get any opportunity to play against him. So I got to see some awesome shots from the bat of Kallis the other night.\""},
{"title": "Sikandar Raza scripts historic, also equals Kohli's 2023 record as Zimbabwe win", "url": "/cricket/sikandar-raza-scripts-historic-also-equals-virat-kohlis-2023-record-as-zimbabwe-win-in-world-cup-qualifiers-101701138985133.html", "content": "Namibia and Zimbabwe secured crucial victories against Kenya and Rwanda respectively on Monday in the ICC Men's T20 World Cup Africa Region Qualifier.A disciplined Namibia bowling line-up made Kenya toil hard in the early overs. Kenya lost openers Rushabhvardhan Patel (1), Collins Obuya (15), and Pushkar Sharma (5) for paltry scores.Irfan Karim (43*) and Sachin Bhudia (18) came together to stabilise the innings with their crucial knocks. However, the lack of firepower in the final phase resulted in Kenya finishing the innings at 104/6.While chasing 105, Namibia added 20 runs for the first wicket, Michael van Lingen was the first player to fall after edging the ball which was taken behind the wicket.In the subsequent overs, Namibia lost three more wickets in a space of just 27 runs. It seemed as if Kenya had found a way to sneak back in, Jan Frylinck (57*) and JJ Smit (14*) put a halt in their attempt and put in a quick-paced match-winning stand of 59 runs.With this win, Namibia sit at the top of the Africa Region Qualifier points table. They have four wins from four contests and have eight points to their name. Despite losing this game, Kenya managed to hold on to their second place with six points.In the second game of the day, Zimbabwe won by 144 runs against Rwanda. After suffering a shocking defeat to Uganda, Zimbabwe's aspirations to qualify for the T20 World Cup were challenged, but they produced a good brand of cricket against Rwanda to keep their chances of qualification alive.Zimbabwe's experienced all-rounder Sikandar Raza led the charge with a special performance with both bat and the ball. Leading from the front, the skipper opened the batting and hit a quick-fire 58 in 36 balls.His knock was graced with six fours and four sixes. His partner on the other end, Tadiwanashe Marumani matched Raza and added 50 from 31 balls with the help of three fours and three sixes.Brisk contributions from Ryan Burl (44* from 21) and Luke Jongwe (17* from 4) in the death overs, helped Zimbabwe to 215/4.Raza continued his stunning form and did serious damage with the ball. His efforts ensured that the Rwanda chase was never able to spread its wings right from the kick-off. While Richard Ngrava (3/11), and Blessing Muzarabani (1/10) did the early damage, Ryan Burl (2/7) hit the middle-order with his clinical spell.Raza came in and finished the game once more for Zimbabwe. He wiped off the tail with a hat-trick in the 19th over - the first by a Zimbabwe men's cricketer in this format - to finish the game with a figure of 3/3.Raza's heroic with both bat and ball earned him the Player of the Match award. This was his sixth Player of the Match award this year, the joint most with India's Virat Kohli.Despite this win, Zimbabwe sit in the fourth spot with only four points on the table and needs other results to fall their way in order to qualify. Uganda hold the second spot with six points and a net run rate of 0.503."},
{"title": "'Rohit shouldn't have said this…': Gambhir on India captain's remark on Dravid", "url": "/cricket/rohit-shouldnt-have-said-this-in-the-media-gambhir-unhappy-with-india-captains-statement-on-rahul-dravid-101701157158513.html", "content": "Gautam Gambhir lauded 's coaching stint, calling it a successful one but reminded captain  that the team wants to win the World Cup for the country and not any particular individual.  was reacting to a question about Dravid's future as India head coach. The former India captain's tenure has come to an end after the ODI World Cup and if reports are to be believed then . Dravid failed to bring an end to India's ICC trophy drought losing to two finals and a semi-final but he achieved huge success in bilateral series. India are currently No.1 in the ICC rankings of all three formats.Gambhir said Dravid's contract should definitely be renewed if he wants to continue. \"Dravid's contract as head coach should be automatically renewed. The kind of cricket that India played throughout the World Cup, if you are going to judge a coach by just one match then it is a wrong precedent,\" he said on .The former India opener, who has played under in the early stages of his career, however, expressed his reservations against Rohit's statements before the . On the eve of the final against Australia, Rohit had said that the team wanted to win the trophy for head coach Dravid for the kind of efforts he has put in for the betterment of the players.\"The way he stood by the players in difficult times, especially during the T20 World Cup, where we had a good run up until that semifinal, where we lost. How he reacted to certain situations and informed the players was helpful. He wants to be part of this big occasion, and it's for us to do it for him,\" the Indian captain had said.Gambhir said Rohit shouldn't have made such a statement to the media. The former opener gave the example of the 2011 World Cup where many Indian players openly said that they wanted to win the World Cup for Sachin Tendulkar.\"Every player, every coach wants to win the World Cup. If he wants a renewal then definitely he should be given that chance. What better than continuity? I would never understand one thing. It happened during our time in 2011 too. When you say that you want to win the World Cup an individual, doesn't matter who that is... this statement is not right.\"You are trying to win the World Cup for the entire country. And if you want to say such a thing then don't say it in the media. Keep it within yourself. The truth is, it is more important to win a World Cup for the nation. I was asked the same in 2011 when everyone said we were trying to win the World Cup for one individual, I said no I want to win the Cup for my country. I picked up the bat for my country. So Rohit probably shouldn't have said this.Gambhir, however again reiterated that Dravid should remain the India head coach and build towards the next T20 and ODI World Cups.\"But as far as Dravid's coaching credentials are concerned, he should be definitely given an extension if he wants to continue. I', very happy with his tenure. And not just for a year but at least two years because India will enter a rebuilding phase soon. You might not see Rohit Sharma, Bumrah and Shami in the next World Cup. So it's important to build towards the 50 over World Cup,\" he added."},
{"title": "‘Accept your mistake, I’m sorry. You made India World Cup champs before final'", "url": "/cricket/you-have-to-accept-your-mistake-too-i-m-sorry-you-made-india-world-cup-winners-before-the-final-wasim-akram-101701146557114.html", "content": "Legendary Pakistan cricketer  blamed the fans, social media and television channels for declaring  as  champions even before the final against Australia had taken place. India won a record 10 games on the trot to reach the finals of the tournament and were the favourites to win the title for the third time. But what transpired at the Narendra Modi Stadium in Ahmedabad on November 19 broke a billion hearts. Australia captain  after winning the toss in the final. That turned out to be a significant moment in the game and highlighted the tactical brilliance of the Aussies.The Australia pacers led by , completely choked India in the middle overs, giving only four boundaries between overs 11 to 40 in the final. Despite a brisk start provided by captain Rohit Sharma in the powerplay, India stuttered their way to 240 on a track that was slow, to say the least.Australia read the conditions perfectly. They knew that the black soil used for the pitch wouldn't break like the red one as the game progressed. And because of due and the increase in moisture at night, the pitch would ease out. That's exactly what happened.Just like with the bat, India got off to a great start with the ball, reducing Australia to 47/3 but as the match progressed, the pitch became easier to bat on, which was in complete contrast to what India faced earlier in the day.This, however, takes nothing away from the way Travis Head batted. The left-hander became the third Australian after Ricky Ponting and Adam Gilchrist to hit a century in a World Cup final to guide his team to their record-extending sixth title.The close to 95 thousand crowd in Ahmedabad was silenced and more than a billion Indian fans watching the streaming from various parts of the world were left with a broken heart.Akram said having high expectations from that Indian team was natural declaring them as champions on social media and television was wrong. \"I can understand that as a nation it will be tough to get over it because your team played so well throughout the tournament. They won 10 matches on the trot, there was consistency. But television, social media, fans... you all already made India the winner of World Cup. You accept your mistake too, I'm sorry. You increased the hope of the people because they were playing so well. It's not entirely your fault. They were playing very good cricket. But it came to just one bad game. Credit goes to Australia,\" he said on Star Sports.The former Pakistan captain said the way Australia executed their plans while bowling the in the middle overs, proved to be the deciding factor in the summit clash. \"In the middle overs from 11-40, there were very few boundaries because of the way they bowled. They didn't bowl a single pace-on delivery to Suryakumar Yadav. Fine-leg and thirdman were literally behind the keeper. So they had better plans,\" he added.Akram also revealed that Pakistani fans are yet to forget the loss in the 1999 World Cup final. \"First of all, the Indian team played really well. It feels like a shock (that they lost in the final), they are down but it's alright. I still get asked about the loss in the 1999 World Cup final. When will our fans forget this? The fans of India and Pakistan have an elephant's memory. It's been 30 years since we lost that final and they still ask me why I opted to bat after winning the toss. So, don't take social media seriously, half of it is just drama.The legendary left-arm fast bowler urged the Indian fans to move on and cheer for their team in the upcoming T20 World Cup in June 2024. \"As a nation, you have to move on, there's another World Cup coming in six months,\" he said."},
{"title": "Bangladesh 104-2 at lunch after winning the toss and batting in series-opener against New Zealand", "url": "/cricket/bangladesh-104-2-at-lunch-after-winning-the-toss-and-batting-in-series-opener-against-new-zealand-101701156994788.html", "content": "He shared stands of 39 or the first wicket with Zakir Hasan and 53 for the second with Najmul Hossain Shanto as Bangladesh made steady progress after winning the toss and opting to bat. Shanto, who led the home team in the absence of Shakib Al Hasan was dismissed just before lunch after playing an attacking 37 off 35 deliveries. He was particularly harsh on left-arm spinner Ajaz Patel, hitting him for three sixes to entertain the sparse crowd. Patel, one of the only three bowlers ever to take 10 wickets in a single test innings, gave the visitors an early breakthrough when he dismissed Zakir Hasan for 12 in the 13th over with a delivery that turned sharply to rattle the stumps. Shanto targeted Patel and opened with a six over mid-on. He used his feet effectively to dominate New Zealand's other spinners -- Ish Sodhi and Glenn Phillips also. But he paid for his aggressive batting when he charged a full toss from offspinner Philips (1-12) and skied a catch to Kane Williamson in the deep, making the score 92-2. Mahmudul, who hit seven fours, accumulated runs calmly to keep the scoreboard moving on a pitch that was ideal for batting. He was batting with Mominul Haque (3) at the break. Bangladesh started without allrounder and captain Shakib and fast bowlers Ebadot Hossain and Taskin Ahmed because of injuries. (AP) DDV"},
{"title": "India vs Australia 3rd T20I, Guwahati weather report: Will rain frustrate India?", "url": "/cricket/india-vs-australia-3rd-t20i-guwahati-weather-today-will-rain-frustrate-ind-as-hosts-look-to-seal-series-win-101701116071043.html", "content": "India go into the third T20I against Australia with a 2-0 lead in the five-match series, which means that a victory in Guwahati would confirm a series win for the side. The team, which is being led by Suryakumar Yadav in his first stint as India captain in any format, thrashed Australia by 44 runs in the second match in Thiruvananthapuram to go two games up. Both of the matches thus far in the series featured 200-plus scores.India had won the first match while chasing and defended a mammoth total in the second. They broke the record for India's highest T20I run chase against Australia in the first game in Visakhapatnam. Australia had scored 208/3 in the first game with Josh Inglis scoring 110 in just 50 balls. India's chase was fuelled by half-centuries from Suryakumar and Ishan Kishan before Rinku pulled them over the line off the last ball of the match. In the second, Yashasvi Jaiswal, Ruturaj Gaikwad, and Ishan Kishan all blazed half-centuries while Rinku hammered an unbeaten 31 in just nine balls as India put up a total of 235/4. Prasidh Krishna and Ravi Bishnoi then took three wickets each as Australia were restricted to a score of 191/9.The players received a warm welcome at Guwahati airport and at their hotel. Youngsters Rinku Singh, Yashasvi Jaiswal and Ravi Bishnoi have stepped up for the team in both matches, while, Suryakumar with his experience has contributed with the bat and added the finishing touches to India's innings.It seems safe to say that any disruption due to rain seems highly unlikely during the third T20I. According to AccuWeather, it is expected to be a clear day on November 28 in the city. The maximum temperature is expected to be 21 degrees Celsius at the start of play around 7:00 pm IST, while the temperature will dip to 19 degrees Celsius at the close of play around 10:30 pm IST.The series shifts to Raipur after this game where the fourth T20I will be played on December 1. The final match will then be played in Bengaluru on December 3."},
{"title": "Australia name fresh squad for India T20Is, release 6 WC winners after 2 losses", "url": "/cricket/australia-release-six-world-cup-winning-squad-members-name-updated-team-for-remaining-three-t20i-vs-india-101701152076300.html", "content": "Australia decided to release six out of their seven World Cup-winning squad members from the ongoing five-match T20I series against India. CricketAustralia.com.au reported that Steve Smith and Adam Zampa have already flown back home while Glenn Maxwell, Marcus Stoinis, Josh Inglis and Sean Abbott will return home on Wednesday after the the third T20I at Guwahati on Tuesday. The decision was taken to give a breather to the players who have been in India for more than two months now. Most of these players were also a part of Australia's ODI squad that played a three-match series against India in the lead-up to the World Cup.Travis Head is the only member of Australia's World Cup-winning squad who will stay back for the remaining matches of this T20I series. Head, the Player of the Match in the World Cup final, is yet to feature in this series.The left-handed opening batter is set to open the batting from the third T20I itself.As far as replacements in the T20I squad are concerned, wicketkeeper-batter Josh Phillippe and big-hitter Ben McDermott have already linked up with the squad in Guwahati and are available for selection.Ben Dwarshuis and off-spinner Chris Green are likely to join the squad on Wednesday ahead of the fourth T20I in Raipur.Green is all set to make his debut in the fourth T20I after the Australian team management felt the need to include a specialist finger spinner in their squad.After losing the first two matches against a superior Indian batting unit, Australia are trailing 0-2 in the series. Smith was the only player of Australia's World Cup final XI that featured in both the T20Is. Stoinis and Abbott, who were part of the World Cup squad but didn't feature in the XI much, also played both matches.Maxwell and Zampa returned for the second T20I but they couldn't do much to change Australia's fortunes.Earlier, David Warner was withdrawn from the T20I squad even before the series began.India, meanwhile, have made no changes to their squad for the third match. Shreyas Iyer, however, will be available for selection from the next match onwards. He will also take over as the vice-captain of the side from Ruturaj Gaikwad. Suryakumar Yadav will continue to lead the side in Hardik Pandya's absence.: Matthew Wade (c), Jason Behrendorff, Tim David, Ben Dwarshuis, Nathan Ellis, Chris Green, Aaron Hardie, Travis Head, Ben McDermott, Josh Philippe, Tanveer Sangha, Matt Short, Kane Richardson Suryakumar Yadav (c), Ruturaj Gaikwad (vc), Ishan Kishan, Yashasvi Jaiswal, Tilak Varma, Rinku Singh, Jitesh Sharma (wk), Washington Sundar, Axar Patel, Shivam Dubey, Ravi Bishnoi, Arshdeep Singh, Prasidh Krishna, Avesh Khan, Mukesh Kumar, Shreyas Iyer (last two matches only)"},
{"title": "Surya faces ‘Sundar’ problem as Jaiswal, Rinku cement spots: India's likely XI", "url": "/cricket/surya-faces-sundar-problem-as-jaiswal-rinku-add-new-dimension-to-side-indias-likely-xi-for-3rd-t20i-vs-australia-101701089891169.html", "content": "India have begun their post-World Cup campaign on a positive note, and are currently leading 2-0 against arch-rivals Australia in their five-match T20I series. Both sides face each other again in the third T20I on Tuesday in Thiruvananthapuram, with the home side looking to bag a series-clinching third victory on the trot.In the last match, chasing 236 runs, the Aussies were restricted to 191/9 in 20 overs, courtesy of a fine effort by the bowling department of India. Ravi Bishnoi and Prasidh Krishna were in fiery form and bagged three-wicket hauls. Initially, India posted 234/5 in 20 overs, courtesy of half-centuries from Ruturaj Gaikwad (58), Yashasvi Jaiswal (53) and Ishan Kishan (52). As far as Australia's bowling was concerned, right-arm pacer Nathan Ellis took three wickets.In the third T20I, India are expected to go with the same playing XI from the previous fixture. Yashasvi Jaiswal and Ruturaj Gaikwad will open for the hosts, and both batters bagged half-centuries in the previous T20I. Jaiswal looked in dream touch in the previous T20I and would look to give India another flying start in Guwahati.Wicketkeeper-batter Ishan Kishan will slot in at no. 3 and he has been in good form in this series. The left-hander who played only two matches for India in the ODI World Cup, has bagged two half-centuries in as many matches but would look to improve his strike rate at the beginning of his innings. In both the matches, he took time to get going.Meanwhile, Suryakumar Yadav, who is captaining the side in this series, will bat at no. 4. He narrowly missed out on a ton in the first T20I, but was dismissed for 19 in the next match.Tilak Varma will bat at no. 5, followed by Rinku Singh in No. 6, who will don the finisher's role. While Axar Patel looks set to take the all-rounder's spot at No.7, India could get tempted to give Washington Sundar a go. Axar was India's pick of the bowlers in the high-scoring last match and is also the most experienced campaigner in India's bowling unit. But because Surya has bowled a lot of spin in the powerplay itself in this series, it might not be a bad idea to try out Sundar, who is a proven customer at that juncture with his economical off-spin.Leg-spinner Ravi Bishonoi is likely to continue as the lead spinnerIn the fast bowling department, India have an option in Avesh Khan but looks like the trio of Arshdeep Singh, Mukesh Kumar, and Prasidh Krishna have done enough to hold on to their spots. Ruturaj Gaikwad, Yashasvi Jaiswal Ishan Kishan, Suryakumar Yadav (c), Tilak Varma, Rinku Singh Washington Sundar/Axar Patel Ravi Bishnoi Prasidh Krishna, Arshdeep Singh, Mukesh Kumar"}
]